package _class;




public class Ex03 {
	public static void main(String[] args) {
		
		// 단일 데이터를 저장하기 위해 필요한 요소 : 변수, 자료형
		// 어떤 유형의 데이터를 어떤 이름의 변수에 저장할 것인가?
		
		// 동일한 자료형의 여러 데이터를 저장하기 위한 요소 : 배열
		// 어떤 유형의 데이터를 몇개나 저장할 것인가?
		
		// 서로 다른 자료형의 여러 데이터를 저장하기 위한 요소 : 구조체(C언어), 클래스(C++, Java)
		
		// 구조체 : 사용자 정의 자료형. 서로 다른 자료형을 가진 변수들의 묶음.
		//	 	-> 단, 구조체 안에는 함수를 넣기가 까다로움.
		
		// 클래스 : 함수를 포함할 수 있는 구조체.
		//		-> 기존에 프로그램 상에 없던 자료형을 사용자가 직접 만들수 있음
		//		-> 클래스 그 자체는 자료형임.
		//		-> 클래스를 이용해서 만든 객체를 활용함
		//		-> 클래스 : 설계도면, 객체 : 자동차
		
		
		
		// 서로 다른 자료형의 데이터를 저장할 수 있는 변수를 가지고 있음
		// 구조체와 달리 클래스는 변수 및 함수를 포함할 수 있음
		
		// 클래스는 자료형임
		// 클래스에 의해 생성된 데이터를 객체라고 함
		
		// 자료형이 필요한 이유 : 변수마다 필요한 용량(바이트 수)이 다르기 때문임
		
		
		
	}

}
