package oop;

public class Ex01 {
	
	// oop : object oriented programming
	// -> 객체 지향 프로그래밍
	// -> ex) 자바
	// 프로그램 내의 모든 사물, 개념, 요소를 객체(object)로 규정하고
	// 객체와 객체의 상호작용의 의해 프로그램이 진행되는 방식으로 작성
	// -> 코드를 구성하는 기본 단위가 함수가 아니라 클래스임.

	
	// 절차 지향 프로그래밍: procedural programming
	// -> 코드를 구성하는 기본 단위가 함수임
	// -> ex) C언어
	// 프로시저(procedure) : 특정한 로직을 처리하기만 하고 결과 값을 반환하지 않는 서브 프로그램 -> void 함수
	// 함수, 서브루틴, 루틴, 메서드, 프로시저 : 소프트웨어에서 특정 동작을 수행하는 일정 코드 부분을 의미함
	
	
	// 메서드 : 특정 문제를 해결하기 위한 방법

	public static void main(String[] args) {
		
		// 1) 내 프로그램의 주제가 무엇인가?
		
		// 2) 프로그램이 다루어야 할 데이터의 자료형은 어떤 것인가?
		//	  - 기본 데이터 자료형을 정의하기 위한 클래스 (속성 중심의 클래스) ~ (JSP - VO,DTO)
		
		// 3) 프로그램이 갖추어야 할 기능에는 어떤 것들이 있는가?
		//	  - 프로그램이 가져야 할 기능을 모아둔 클래스 (기능 중심의 클래스) ~ (JSP - DAO)
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}
